# Data Manipulation with Pandas

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\anandraj\appdata\local\programs\python\python38\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\anandraj\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.22.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\anandraj\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\anandraj\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\anandraj\appdata\local\programs\python\python38\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip available: 22.1.2 -> 22.2.2
[notice] To update, run: python.exe -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

## Series

In [4]:
import numpy as np
import pandas as pd

In [5]:
first_series = pd.Series(list('abcdef'))

In [2]:
print(first_series)

NameError: name 'first_series' is not defined

In [7]:
np_country = np.array(['India', 'Pakistan', 'Japan', 'USA', 'UK', 'Germany'])

In [8]:
s_country = pd.Series(np_country)

In [9]:
print(s_country)

0       India
1    Pakistan
2       Japan
3         USA
4          UK
5     Germany
dtype: object

In [10]:
country_gdp = pd.Series([122222, 23324, 435646, 5645,3746587, 3436764], index=['India', 'Pakistan', 'Japan', 'USA', 'UK', 'Germany'])

In [11]:
print(country_gdp)

India        122222
Pakistan      23324
Japan        435646
USA            5645
UK          3746587
Germany     3436764
dtype: int64

In [12]:
# Print series with scalar
scalar_series = pd.Series(5, index=['a', 'b', 'c', 'd', 'e', 'f'])

In [13]:
scalar_series

a    5
b    5
c    5
d    5
e    5
f    5
dtype: int64

In [14]:
# Accessing elements in series
country_gdp[0]

122222

In [15]:
country_gdp[0:2]

India       122222
Pakistan     23324
dtype: int64

In [1]:
# Using loc and iloc
# loc - selection by label
# iloc - selection by position
country_gdp.loc['USA']

NameError: name 'oc' is not defined

In [17]:
country_gdp.iloc[1]

23324

## Dataframe

In [18]:
import pandas as pd

In [19]:
olympic_datalist = {'HostCity':['London', 'Beijing', 'Sydney'], 'Year':[2012, 2008, 2004], 'Participating Countries':[203, 204, 205]}

In [20]:
df_olympic_data = pd.DataFrame(olympic_datalist)

In [21]:
df_olympic_data

  HostCity  Year  Participating Countries
0   London  2012                      203
1  Beijing  2008                      204
2   Sydney  2004                      205

In [22]:
olympic_dataDict = {'London':{2012:200}, 'Beijing':{2008:200}}

In [23]:
df_olympic_dataDict = pd.DataFrame(olympic_dataDict)

In [24]:
df_olympic_dataDict

      London  Beijing
2012   200.0      NaN
2008     NaN    200.0

In [25]:
df_olympic_data.HostCity

0     London
1    Beijing
2     Sydney
Name: HostCity, dtype: object

In [26]:
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  Year  Participating Countries
0   London  2012                      203
1  Beijing  2008                      204
2   Sydney  2004                      205>

In [27]:
# Dataframe from dictionary of series
olympic_participation = pd.Series([200, 201, 202, 203], index=[2012, 2008, 2007, 2006])
olympic_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney'], index=[2012, 2008,2007, 2006])

In [28]:
df_olympic_series = pd.DataFrame({'Participating Countries': olympic_participation,
                                 'Host Cities': olympic_country})

In [29]:
df_olympic_series

      Participating Countries Host Cities
2012                      200      London
2008                      201     Beijing
2007                      202      Athens
2006                      203      Sydney

In [30]:
# Dataframe from ndarray

import numpy as np

In [31]:
np_array_year = np.array([2012, 2008, 2007, 2006])
np_array_country = np.array(['London', 'Beijing', 'Athens', 'Sydney'])
dict_ndarray = {'Year':np_array_year, 'Host': np_array_country}

In [32]:
df_ndarray = pd.DataFrame(dict_ndarray)

In [33]:
df_ndarray

   Year     Host
0  2012   London
1  2008  Beijing
2  2007   Athens
3  2006   Sydney

In [34]:
# Dataframe from Dataframe
df_from_df = pd.DataFrame(df_olympic_series)

In [35]:
df_from_df

      Participating Countries Host Cities
2012                      200      London
2008                      201     Beijing
2007                      202      Athens
2006                      203      Sydney

In [36]:
import numpy as np
import pandas as pd

In [37]:
olympic_series_participation = pd.Series([205, 204, 201, 200, 197], index=[2012, 2008, 2004, 2000, 1996])
olympic_series_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], index=[2012, 2008, 2004, 2000, 1996])


df_olympic_series = pd.DataFrame({'Participating Countries': olympic_series_participation, 'Host Cities':olympic_series_country})

In [38]:
df_olympic_series

      Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing
2004                      201      Athens
2000                      200      Sydney
1996                      197     Atlanta

In [39]:
df_olympic_series.describe

<bound method NDFrame.describe of       Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing
2004                      201      Athens
2000                      200      Sydney
1996                      197     Atlanta>

In [106]:
df_olympic_series.head(3)

      Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing
2004                      201      Athens

In [41]:
df_olympic_series.tail(3)

      Participating Countries Host Cities
2004                      201      Athens
2000                      200      Sydney
1996                      197     Atlanta

In [42]:
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [43]:
df_olympic_series.columns

Index(['Participating Countries', 'Host Cities'], dtype='object')

In [44]:
df_olympic_series['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [45]:
df_olympic_series['Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: Participating Countries, dtype: int64

In [46]:
 df_olympic_series.iloc[0:2]

      Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing

In [47]:
df_olympic_series.loc[2012]

Participating Countries       205
Host Cities                London
Name: 2012, dtype: object

In [48]:
df_olympic_series.iat[3, 0]

200

In [49]:
df_olympic_series[df_olympic_series['Participating Countries'] > 200]

      Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing
2004                      201      Athens

In [50]:
# Missing Values
import pandas as pd

In [51]:
first_series = pd.Series([1,2,3,4,5], index=['a', 'b', 'c', 'd', 'e'])
second_series = pd.Series([10, 20, 30, 40, 50], index=['c', 'e', 'f', 'g', 'h'])

In [52]:
sum_of_series = first_series + second_series

In [53]:
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [54]:
dropna_s = sum_of_series.dropna()

In [55]:
dropna_s

c    13.0
e    25.0
dtype: float64

In [56]:
fillna_s = sum_of_series.fillna(0)

In [57]:
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [58]:
fill_Nan_with_before_sum = first_series.add(second_series, fill_value=0)

In [59]:
fill_Nan_with_before_sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

## Data Operations

In [60]:
import pandas as pd

In [61]:
df_movie_rating = pd.DataFrame({
    'movie 1': [5,4,3,3,2,1],
    'movie 2': [4,5,2,3,4,2]},
    index = ['Tanjiro', 'Vegeta', 'Jotaro', 'Gojo', 'Eren', 'Deku'])

In [62]:
df_movie_rating

         movie 1  movie 2
Tanjiro        5        4
Vegeta         4        5
Jotaro         3        2
Gojo           3        3
Eren           2        4
Deku           1        2

In [63]:
# Declare a custom function

def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    if rating == 2:
        return 'D'
    else:
        return 'E'

In [64]:
print(movie_grade(1))

E

In [65]:
# DataFrame.applymap(custom_func) is used to map the data

df_movie_rating.applymap(movie_grade)

        movie 1 movie 2
Tanjiro       A       B
Vegeta        B       A
Jotaro        C       D
Gojo          C       C
Eren          D       B
Deku          E       D

In [66]:
df_test_scores = pd.DataFrame({
    'Test 1': [95, 84, 73, 88, 82, 61],
    'Test 2': [74, 85, 82, 73, 77, 79]
}, index = ['Goku', 'Yuji', 'Dio', 'Yahiko', 'Midoriya', 'Inosuke'])

In [67]:
df_test_scores.max()

Test 1    95
Test 2    85
dtype: int64

In [68]:
df_test_scores.mean()

Test 1    80.500000
Test 2    78.333333
dtype: float64

In [69]:
df_test_scores.std()

Test 1    11.979149
Test 2     4.633213
dtype: float64

In [70]:
# groupby in pandas

df_president_name = pd.DataFrame({'first': ['George', 'Bill', 'Ronald', 'Jimmy', 'George'],
                                 'last': ['Bush', 'Clinton', 'Regan', 'Carter', 'Washington']})

In [71]:
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [72]:
grouped = df_president_name.groupby('first')

In [73]:
grouped

In [74]:
grp_data = grouped.get_group('George')

In [75]:
grp_data

    first        last
0  George        Bush
4  George  Washington

In [76]:
# sort_values

df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

In [77]:
df_president_name.sort_values('last')

    first        last
0  George        Bush
3   Jimmy      Carter
1    Bill     Clinton
2  Ronald       Regan
4  George  Washington

## Data Standardization

In [78]:
def standardize_tests(test):
    return (test-test.mean())/ test.std()

In [79]:
standardize_tests(df_test_scores['Test 1'])

Goku        1.210437
Yuji        0.292174
Dio        -0.626088
Yahiko      0.626088
Midoriya    0.125218
Inosuke    -1.627829
Name: Test 1, dtype: float64

In [80]:
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [81]:
standardize_test_scores(df_test_scores)

            Test 1    Test 2
Goku      1.210437 -0.935276
Yuji      0.292174  1.438886
Dio      -0.626088  0.791387
Yahiko    0.626088 -1.151109
Midoriya  0.125218 -0.287777
Inosuke  -1.627829  0.143889

In [82]:
df_student_math = pd.DataFrame({
    'student': ['Rengoku', 'Tengen', 'Zenitsu', 'Nezuko', 'Akaza', 'Muzan'],
    'ID': [10, 56, 31, 85, 9, 22]
})

In [83]:
df_student_science = pd.DataFrame({'student': ['Rengoku', 'Akaza', 'Tengen'], 'ID': [10, 9, 56]})

In [84]:
# Merge

pd.merge(df_student_math, df_student_science)

   student  ID
0  Rengoku  10
1   Tengen  56
2    Akaza   9

In [85]:
# merge with key on student

pd.merge(df_student_math, df_student_science, on='student')

   student  ID_x  ID_y
0  Rengoku    10    10
1   Tengen    56    56
2    Akaza     9     9

In [86]:
# merge left join on key ID and also fill NaN values with X

pd.merge(df_student_math, df_student_science, on='ID', how='left').fillna('X')

  student_x  ID student_y
0   Rengoku  10   Rengoku
1    Tengen  56    Tengen
2   Zenitsu  31         X
3    Nezuko  85         X
4     Akaza   9     Akaza
5     Muzan  22         X

In [87]:
# concatenate dataframes

pd.concat([df_student_math, df_student_science], ignore_index = True)

   student  ID
0  Rengoku  10
1   Tengen  56
2  Zenitsu  31
3   Nezuko  85
4    Akaza   9
5    Muzan  22
6  Rengoku  10
7    Akaza   9
8   Tengen  56

In [88]:
df_student_survey_data = pd.DataFrame({
    'student': ['Rengoku', 'Tengen', 'Zenitsu', 'Nezuko', 'Akaza', 'Muzan'],
    'ID': [10, 56, 22, 85, 56, 22]
})

In [89]:
df_student_survey_data

   student  ID
0  Rengoku  10
1   Tengen  56
2  Zenitsu  22
3   Nezuko  85
4    Akaza  56
5    Muzan  22

In [90]:
# Check for duplicates

print(df_student_survey_data.duplicated('ID'))

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [91]:
# drop duplicates with student as key

df_student_survey_data.drop_duplicates('student')

   student  ID
0  Rengoku  10
1   Tengen  56
2  Zenitsu  22
3   Nezuko  85
4    Akaza  56
5    Muzan  22

In [92]:
df_student_survey_data.drop_duplicates('ID')

   student  ID
0  Rengoku  10
1   Tengen  56
2  Zenitsu  22
3   Nezuko  85

## Pandas SQL Operation

In [93]:
import pandas as pd

In [94]:
import sqlite3

In [95]:
create_table = """
CREATE TABLE student_score (
Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL);"""

In [96]:
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [97]:
SQL_query = executeSQL.execute('select * from student_score')

In [98]:
resultset = SQL_query.fetchall()

In [99]:
resultset

[]

In [100]:
insertSQL = [(1, 'Goku', 75, 65),(2, 'Gohan', 99, 100), (3, 'Vegeta', 80, 91)]

In [101]:
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement, insertSQL)
executeSQL.commit()

In [102]:
SQL_query = executeSQL.execute("select * from student_score")

In [103]:
resultset = SQL_query.fetchall()

In [104]:
resultset

[(1, 'Goku', 75.0, 65.0), (2, 'Gohan', 99.0, 100.0), (3, 'Vegeta', 80.0, 91.0)]